{
  "acoustic_vae_dim": 64,
  "acoustic_tokenizer_config": {
    "causal": true,
    "channels": 1,
    "decoder_n_filters": 32,
    "decoder_ratios": [8, 5, 5, 4, 2, 2],
    "layernorm_eps": 0.00001,
    "model_type": "vibevoice_acoustic_tokenizer",
    "vae_dim": 64
  },
  "architectures": ["VibeVoiceStreamingForConditionalGenerationInference"],
  "decoder_config": {
    "hidden_size": 896,
    "intermediate_size": 4864,
    "max_position_embeddings": 8192,
    "model_type": "qwen2",
    "num_attention_heads": 14,
    "num_hidden_layers": 24,
    "num_key_value_heads": 2,
    "rms_norm_eps": 0.000001,
    "rope_theta": 1000000.0,
    "torch_dtype": "bfloat16",
    "vocab_size": 151936
  },
  "diffusion_head_config": {
    "ddpm_beta_schedule": "cosine",
    "ddpm_num_inference_steps": 20,
    "ddpm_num_steps": 1000,
    "diffusion_type": "ddpm",
    "head_ffn_ratio": 3.0,
    "head_layers": 4,
    "hidden_size": 896,
    "latent_size": 64,
    "model_type": "vibevoice_diffusion_head",
    "prediction_type": "v_prediction",
    "rms_norm_eps": 0.00001,
    "speech_vae_dim": 64
  },
  "model_type": "vibevoice_streaming",
  "torch_dtype": "bfloat16",
  "tts_backbone_num_hidden_layers": 20
}
